#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МодельПриИзменении(Элемент)
	СписокСН = ПолучитьСписокСНСервер(Объект.Модель);
	Для Каждого СН из СписокСН Цикл
		НоваяСтрока = Объект.СерийныеНомера.Добавить();
		НоваяСтрока.СерийныйНомер = СН.Ключ;
		НоваяСтрока.ИнвентарныйНомер = СН.Значение;
	КонецЦикла; 
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокСНСервер(Модель)
	
	СписокСН = Новый Структура();
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	|	СерийныеНомера.МодельОборудования КАК МодельОборудования,
	|	СерийныеНомера.СерийныйНомер КАК СерийныйНомер,
	|	СерийныеНомера.ИнвентарныйНомер КАК ИнвентарныйНомер
	|ИЗ
	|	РегистрСведений.СерийныеНомера КАК СерийныеНомера
	|ГДЕ
	|	СерийныеНомера.МодельОборудования = &Модель";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Модель", Модель);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокСН.Вставить(Выборка.СерийныйНомер, Выборка.ИнвентарныйНомер);	
	КонецЦикла;
	Возврат СписокСН;
	
КонецФункции

#КонецОбласти

