
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ОстатокМЦ Приход
	Движения.ОстатокМЦ.Записывать = Истина;
	Движения.СерийныйНомер.Записывать = Истина;
	
	Для Каждого ТекСтрокаСписокМЦ Из СписокМЦ Цикл
		Движение = Движения.ОстатокМЦ.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.МодельОборудования = ТекСтрокаСписокМЦ.МодельОборудования;
		Движение.Ответственный = Ответственный;
		Движение.Количество = ТекСтрокаСписокМЦ.Количество;
		
		// Информация
		
		Если ТекСтрокаСписокМЦ.Количество = 1 И ЗначениеЗаполнено(ТекСтрокаСписокМЦ.СерийныйНомер) Тогда
			Информация = Движения.СерийныйНомер.Добавить();
			Информация.Период = Дата;
			Информация.МодельОборудования = ТекСтрокаСписокМЦ.МодельОборудования;
			Информация.Ответственный = Ответственный;
			Информация.СерийныйНомер = ТекСтрокаСписокМЦ.СерийныйНомер;
		КонецЕсли
		
	КонецЦикла;
КонецПроцедуры
