Процедура ОбработкаПроведения(Отказ,Режим)
	// регистр СерийныеНомера
	Движения.СерийныеНомера.Записывать = Истина;
	Запрос = Новый Запрос();
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПрисвоитьИнвНомерСерийныеНомера.СерийныйНомер КАК СерийныйНомер,
	|	ПрисвоитьИнвНомерСерийныеНомера.ИнвентарныйНомер КАК ИнвентарныйНомер
	|ПОМЕСТИТЬ ВТ_Документ
	|ИЗ
	|	Документ.ПрисвоитьИнвНомер.СерийныеНомера КАК ПрисвоитьИнвНомерСерийныеНомера
	|ГДЕ
	|	ПрисвоитьИнвНомерСерийныеНомера.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СерийныеНомера.СерийныйНомер КАК СерийныйНомер,
	|	ВТ_Документ.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	СерийныеНомера.Регистратор КАК Регистратор
	|ИЗ
	|	ВТ_Документ КАК ВТ_Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СерийныеНомера КАК СерийныеНомера
	|		ПО ВТ_Документ.СерийныйНомер = СерийныеНомера.СерийныйНомер";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Набор = РегистрыСведений.СерийныеНомера.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(Выборка.Регистратор);
		Набор.Прочитать();
		Для Каждого Запись Из Набор Цикл
			Если Запись.СерийныйНомер = Выборка.СерийныйНомер Тогда
				Запись.ИнвентарныйНомер = Выборка.ИнвентарныйНомер;
			КонецЕсли;
			Если Набор.Модифицированность() Тогда
				Набор.Записать();
			КонецЕсли
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры