Процедура ОбработкаПроведения(Отказ,Режим)
	// регистр СерийныеНомера
	Движения.СерийныеНомера.Записывать = Истина;
	Запрос = Новый Запрос();
	ТекстЗапроса = "";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	
	Для Каждого ТекСтрокаСерийныеНомера из СерийныеНомера Цикл
		Движение = Движения.СерийныеНомера.Добавить();
		Движение.МодельОборудования = Модель;
		Движение.СерийныйНомер = ТекСтрокаСерийныеНомера.СерийныйНомер;
		Движение.ИнвентарныйНомер = ТекСтрокаСерийныеНомера.СерийныйНомер;
	КонецЦикла;

КонецПроцедуры